{
  "featuredMovies": [
  {
  "id": 1,
  "title": "Avengers",
  "poster": "Images/Avengers.jpg",
  "description": "A superhero ensemble film featuring iconic Marvel characters teaming up to save the world from various threats."
  },
  {
  "id": 2,
  "title": "The Lion King",
  "poster": "Images/The Lion King.jpg",
  "description": "A classic Disney animated film following the journey of a young lion prince reclaiming his kingdom from his evil uncle."
  },
  {
  "id": 3,
  "title": "Joker",
  "poster": "Images/Joker.jpg",
  "description": "A dark and gritty origin story of the infamous DC Comics supervillain, exploring themes of mental illness and societal decay."
  },
  {
  "id": 4,
  "title": "Parasite",
  "poster": "Images/Parasite.jpg",
  "description": "A critically acclaimed South Korean thriller film about a poor family infiltrating the lives of a wealthy household with unexpected consequences."
  },
  {
  "id": 5,
  "title": "1917",
  "poster": "Images/1917.jpg",
  "description": "A gripping war drama set during World War I, following two British soldiers tasked with delivering a vital message to save a battalion from a trap."
  },
  {
  "id": 6,
  "title": "Once Upon a Time in Hollywood",
  "poster": "Images/Once Upon a Time in Hollywood.jpg",
  "description": "A nostalgic journey through late 1960s Hollywood, intertwining the lives of a fading TV star and his stunt double with real-life events."
  }
  ],
  "featuredTVShows": [
  {
  "id": 1,
  "title": "Chernobyl",
  "poster": "Images/Chernobyl.jpg",
  "description": "A gripping historical drama miniseries depicting the Chernobyl nuclear disaster and its aftermath, highlighting the human cost and government cover-up."
  },
  {
  "id": 2,
  "title": "Fleabag",
  "poster": "Images/Fleabag.jpg",
  "description": "A dark comedy-drama series following the chaotic life of a witty and sexually adventurous woman navigating relationships and personal struggles."
  },
  {
  "id": 3,
  "title": "Mindhunter",
  "poster": "Images/Mindhunter.jpg",
  "description": "A psychological crime thriller series based on true events, focusing on FBI agents interviewing serial killers to understand and catch criminals."
  },
  {
  "id": 4,
  "title": "Succession",
  "poster": "Images/Succession.jpg",
  "description": "A satirical drama series exploring the power struggles within a wealthy media family as they vie for control of their father's empire."
  },
  {
  "id": 5,
  "title": "Watchmen",
  "poster": "Images/Watchmen.jpg",
  "description": "A thought-provoking superhero drama series set in an alternate reality where masked vigilantes are treated as outlaws, tackling complex social issues."
  },
  {
  "id": 6,
  "title": "Game of Thrones",
  "poster": "Images/Game of Thrones.jpg",
  "description": "An epic fantasy series depicting the power struggles and battles for control of the Seven Kingdoms of Westeros, based on George R.R. Martin's novels."
  }
  ],
    "collection": [
      {
        "id": 1,
        "type": "movie",
        "title": "Avengers: Endgame",
        "synopsis": "After the devastating events of Avengers: Infinity War, the universe is in ruins. With the help of remaining allies, the Avengers assemble once more in order to undo Thanos' actions and restore order to the universe. The film is a thrilling conclusion to the epic saga of the Marvel Cinematic Universe.",
        "smallPoster": "Images/Avengers.jpg",
        "largePoster": "Images/Ironman.jpg",
        "rentPrice": 4.99,
        "purchasePrice": 19.99
      },
      {
        "id": 2,
        "type": "movie",
        "title": "Wonder",
        "synopsis": "Based on the New York Times bestseller, WONDER tells the incredibly inspiring and heartwarming story of August Pullman, a boy with facial differences who enters fifth grade, attending a mainstream elementary school for the first time.",
        "smallPoster": "Images/Wonder.jpg",
        "largePoster": "Images/wondermom.jpg",
        "rentPrice": 3.99,
        "purchasePrice": 14.99
      },
      {
        "id": 3,
        "type": "tv",
        "title": "Watchmen",
        "synopsis": "In a small town where everyone knows everyone, a group of teenagers discover a strange series of events when they begin investigating the disappearance of a young boy. The series is a gripping mystery with complex characters and a thought-provoking exploration of morality.",
        "smallPoster": "Images/Watchmen.jpg",
        "largePoster": "Images/watch.jpg",
        "rentPrice": 2.99,
        "purchasePrice": 9.99
      },
      {
        "id": 4,
        "type": "tv",
        "title": "The Shawshank Redemption",
        "synopsis": "Nine noble families fight for control over the lands of Westeros, while an ancient enemy returns after being dormant for millennia. The series is renowned for its intricate plot, compelling characters, and stunning visual effects.",
        "smallPoster": "Images/The Shawshank.jpg",
        "largePoster": "Images/srdm.jpg",
        "rentPrice": 2.99,
        "purchasePrice": 9.99
      },
      {
        "id": 5,
        "type": "movie",
        "title": "The Queen's Gambit",
        "synopsis": "Two imprisoned men bond over a number of years, finding solace and eventual redemption through acts of common decency. The film is a moving exploration of friendship, hope, and the power of the human spirit.",
        "smallPoster": "Images/The Queen's Gambit.jpg",
        "largePoster": "Images/queen.jpg",
        "rentPrice": 3.49,
        "purchasePrice": 12.99
      },
      {
        "id": 6,
        "type": "tv",
        "title": "The Greatest Showman",
        "synopsis": "A high school chemistry teacher turned methamphetamine manufacturer partners with a former student to create and sell the purest methamphetamine on the market. The series is a gripping drama that delves into the dark underworld of drug trafficking.",
        "smallPoster": "Images/The Greatest Showman.jpg",
        "largePoster": "Images/show.jpg",
        "rentPrice": 2.99,
        "purchasePrice": 9.99
      },
      {
        "id": 7,
        "type": "movie",
        "title": "Forrest Gump",
        "synopsis": "The presidencies of Kennedy and Johnson, the events of Vietnam, Watergate, and other historical events unfold from the perspective of an Alabama man with an IQ of 75, whose only desire is to be reunited with his childhood sweetheart. The film is a heartwarming journey through decades of American history.",
        "smallPoster": "Images/Forrest Gump.jpg",
        "largePoster": "Images/forrest.jpg",
        "rentPrice": 3.99,
        "purchasePrice": 14.99
      },
      {
        "id": 8,
        "type": "tv",
        "title": "The Office",
        "synopsis": "A mockumentary on a group of typical office workers, where the workday consists of ego clashes, inappropriate behavior, and tedium. The series is a hilarious and relatable portrayal of office life, featuring memorable characters and laugh-out-loud moments.",
        "smallPoster": "Images/The Office.jpg",
        "largePoster": "Images/office.jpg",
        "rentPrice": 2.99,
        "purchasePrice": 9.99
      },
      {
        "id": 9,
        "type": "movie",
        "title": "Parks and Recreation",
        "synopsis": "A thief who steals corporate secrets through the use of dream-sharing technology is given the inverse task of planting an idea into the mind of a C.E.O. The film is a mind-bending thriller that explores the nature of reality and the power of the human mind.",
        "smallPoster": "Images/Parks and Recreation.jpg",
        "largePoster": "Images/parks.jpg",
        "rentPrice": 4.49,
        "purchasePrice": 16.99
      },
      {
        "id": 10,
        "type": "tv",
        "title": "Friends",
        "synopsis": "Follows the personal and professional lives of six twenty to thirty-something-year-old friends living in Manhattan. The series is a beloved classic, known for its witty humor, memorable characters, and heartwarming moments.",
        "smallPoster": "Images/Friends.jpg",
        "largePoster": "Images/fri.jpg",
        "rentPrice": 2.99,
        "purchasePrice": 9.99
      },
      {
        "id": 11,
        "type": "tv",
        "title": "Finding Nemo",
        "synopsis": "Marlin, a clownfish, embarks on a journey across the ocean to find his son, Nemo, who has been captured by a diver and placed in a fish tank. Along the way, Marlin encounters various sea creatures, including Dory, a forgetful blue tang fish, who helps him in his quest.",
        "smallPoster": "Images/Finding Nemo.jpg",
        "largePoster": "Images/nemo.jpg",
        "rentPrice": 2.99,
        "purchasePrice": 9.99
      },
      {
        "id": 12,
        "type": "tv",
        "title": "Brooklyn NineNine",
        "synopsis": "Set in the fictional 99th precinct of the New York City Police Department in Brooklyn, the series follows a team of detectives led by the immature but talented Detective Jake Peralta. Full of humor, witty banter, and quirky characters, Brooklyn Nine-Nine delivers laughs and heartwarming moments.",
        "smallPoster": "Images/Brooklyn NineNine.jpg",
        "largePoster": "Images/99.jpg",
        "rentPrice": 2.99,
        "purchasePrice": 9.99
      }
    ]
  }
  
  